[
    {
      "CourseID": "CISC108",
      "Name": "Introduction to Computer Science I",
      "Kind": "Required",
      "Description": "Computing and principles of programming with an emphasis on systematic program design. Topics include functional programming, data abstraction, procedural abstraction, use of control and state, recursion, testing, and object-oriented programming concepts. Requires no prior programming experience, open to any major, but intended primarily for majors and minors in computer science or mathematics.",
      "Prerequisite": "N/A"
    },
    {
      "CourseID": "CISC181",
      "Name": "Introduction to Computer Science II",
      "Kind": "Required",
      "Description": "Principles of computer science illustrated and applied through programming in an object oriented language. Programming projects illustrate computational problems, styles and issues that arise in computer systems development and in all application areas of computation.",
      "Prerequisite": "CISC108 OR CISC106"
    },
    {
      "CourseID": "CISC210",
      "Name": "Introduction to Systems Programming",
      "Kind": "Required",
      "Description": "Principles of computer systems programming for software and hardware platforms to achieve efficient resource usage. Topics include the C programming language, memory management, and awareness of system constraints and interfacing. Projects include programming embedded systems and interactive objects.",
      "Prerequisite": "CISC108 OR CISC106"
    },
    {
      "CourseID": "CISC220",
      "Name": "Data Structures",
      "Kind": "Required",
      "Description": "Review of data type abstraction, recursion, arrays, stacks, queues, multiple stacks and linked lists. Emphasis on dynamic storage management, garbage collection, trees, graphs, tables, sorting and searching.\nRepeatable for Credit: N Allowed Units: 3 Multiple Term Enrollment: N Grading Basis: Student Option\nCOREQ: MATH 210 or MATH 241.",
      "Prerequisite": "CISC210"
    },
    {
      "CourseID": "CISC260",
      "Name": "Machine Organization and Assembly Language",
      "Kind": "Required",
      "Description": "Introduction to the basics of machine organization. Programming tools and techniques at the machine and assembly levels. Assembly language programming and computer arithmetic techniques.",
      "Prerequisite": "CISC210"
    },
    {
      "CourseID": "CISC275",
      "Name": "Introduction to Software Engineering",
      "Kind": "Required",
      "Description": "Object oriented software design and development through use of an object oriented programming language. Topics include team programming, design patterns, graphical user interfaces, software engineering tools (e.g., integrated development environments, version control, build management, bug tracking, automated testing).\nRepeatable for Credit: N Allowed Units: 3 Multiple Term Enrollment: N Grading Basis: Student Option",
      "Prerequisite": "CISC181 AND CISC220"
    },
    {
      "CourseID": "CISC355",
      "Name": "Computers, Ethics and Society",
      "Kind": "Required",
      "Description": "Explains relationships among information technology, society and ethics by examining issues raised by increasingly widespread use of computers. Topics include ethics for computer professionals, computer impact on factory work, office work, personal privacy and social power distribution.",
      "Prerequisite": "N/A"
    },
    {
      "CourseID": "CISC387",
      "Name": "Vertically Integrated Projects III",
      "Kind": "Technical electives",
      "Description": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise.\nInformation valid for courses offered 2021 through 2022.\nCross-listed with ELEG387Link opens in new window. (owner).\nNotes: This course requires significant time commitment for project work in addition to the established meeting time.\nCross listed with ELEG387012.",
      "Prerequisite": "N/A"
    },
    {
      "CourseID": "CISC442",
      "Name": "Introduction to Computer Vision",
      "Kind": "Technical electives",
      "Description": "Analysis of images and video to recognize, reconstruct, model, and otherwise infer static and dynamic properties of objects in the three-dimensional world. Geometry of image formation; image processing such as smoothing, edge and feature detection, color, and texture; segmentation; shape representation including deformable templates; stereo vision; motion estimation and tracking; techniques for 3-D reconstruction; image registration methods.",
      "Prerequisite": "CISC220"
    },
    {
      "CourseID": "CISC449",
      "Name": "Topics in Computer Applications: INTERNET SECURITY WITH MOBILE",
      "Kind": "Technical electives",
      "Description": "Contents will vary to coincide with the interests of students and current faculty.",
      "Prerequisite": "CISC 220"
    }
  ]